Revit 2027 API
VertexStreamPositionNormalColored.AddVertices Method
 Inserts multiple VertexStreamPositionNormalColored instances into the stream and associated buffer.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddVertices(
	IList<VertexPositionNormalColored> vertices
)
Public Sub AddVertices (
	vertices As IList(Of VertexPositionNormalColored)
)
public:
void AddVertices(
	IList<VertexPositionNormalColored^>^ vertices
)
member AddVertices :
        vertices : IList<VertexPositionNormalColored> -> unit
Parameters
vertices IList<VertexPositionNormalColored>
 The vertices to be inserted.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Thrown if the associated buffer is not mapped. -or- Thrown if the associated buffer has insufficient space.
See Also
Reference
VertexStreamPositionNormalColored Class
Autodesk.Revit.DB.DirectContext3D Namespace